urbanFlow/wStock/urans/winter/0/omega
/*--------------------------------*- C++ -*----------------------------------*\
  =========                 |
  \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox
   \\    /   O peration     | Website:  https://openfoam.org
    \\  /    A nd           | Version:  13
     \\/     M anipulation  |
\*---------------------------------------------------------------------------*/
FoamFile
{
    format      ascii;
    class       volScalarField;
    object      omega;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
dimensions      [0 0 -1 0 0 0 0];
internalField   uniform 0.8431743585870806;
boundaryField
{
    inlet { type            turbulentMixingLengthFrequencyInlet;
            mixingLength    4.1;
            z0              uniform 0.8;
            flowDir         (1 0 0); 
            zDir            (0 0 1);
            zGround uniform 0.0;
            Zref 10.0;
            Uref            6.9;
            uStar           1.1200728179470778;
            kappa           0.41;
            value           $internalField; 
            }
    outlet { type zeroGradient; }
    ground { type omegaWallFunction; value $internalField; }
    buildings { type omegaWallFunction; value $internalField; }
    frontAndBack { type symmetry; }
    sky { type slip; }
}